Dataset/All/data/nomad-sn-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client-t8-c512-d30-R10000-N5
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=10000
Running 30s test @ http://10.10.1.4:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 1816.345ms, rate sampling interval: 8228ms
  Thread calibration: mean lat.: 2371.476ms, rate sampling interval: 10616ms
  Thread calibration: mean lat.: 2549.815ms, rate sampling interval: 10625ms
  Thread calibration: mean lat.: 2291.223ms, rate sampling interval: 9658ms
  Thread calibration: mean lat.: 2765.281ms, rate sampling interval: 11329ms
  Thread calibration: mean lat.: 2362.913ms, rate sampling interval: 9838ms
  Thread calibration: mean lat.: 2642.162ms, rate sampling interval: 10846ms
  Thread calibration: mean lat.: 2788.038ms, rate sampling interval: 11509ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.51s     3.76s   19.87s    63.71%
    Req/Sec   317.18     94.96   386.00     81.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.42s 
 75.000%   14.30s 
 90.000%   16.47s 
 99.000%   19.87s 
 99.900%   22.74s 
 99.990%   24.08s 
 99.999%   24.12s 
100.000%   24.13s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2519.039     0.000000            1         1.00
    6520.831     0.100000         5285         1.11
    7929.855     0.200000        10584         1.25
    9232.383     0.300000        15864         1.43
   10256.383     0.400000        21150         1.67
   11419.647     0.500000        26440         2.00
   12001.279     0.550000        29070         2.22
   12599.295     0.600000        31709         2.50
   13172.735     0.650000        34343         2.86
   13746.175     0.700000        37004         3.33
   14295.039     0.750000        39628         4.00
   14598.143     0.775000        40952         4.44
   14942.207     0.800000        42262         5.00
   15278.079     0.825000        43587         5.71
   15630.335     0.850000        44911         6.67
   16039.935     0.875000        46233         8.00
   16244.735     0.887500        46892         8.89
   16465.919     0.900000        47550        10.00
   16719.871     0.912500        48211        11.43
   17006.591     0.925000        48887        13.33
   17367.039     0.937500        49545        16.00
   17547.263     0.943750        49864        17.78
   17743.871     0.950000        50184        20.00
   17989.631     0.956250        50524        22.86
   18235.391     0.962500        50853        26.67
   18546.687     0.968750        51188        32.00
   18694.143     0.971875        51341        35.56
   18857.983     0.975000        51512        40.00
   19103.743     0.978125        51672        45.71
   19349.503     0.981250        51838        53.33
   19628.031     0.984375        52005        64.00
   19709.951     0.985938        52088        71.11
   19791.871     0.987500        52182        80.00
   19841.023     0.989062        52250        91.43
   19906.559     0.990625        52350       106.67
   19955.711     0.992188        52447       128.00
   19972.095     0.992969        52492       142.22
   19988.479     0.993750        52524       160.00
   20004.863     0.994531        52545       182.86
   20135.935     0.995313        52577       213.33
   20348.927     0.996094        52618       256.00
   20512.767     0.996484        52641       284.44
   20627.455     0.996875        52659       320.00
   20725.759     0.997266        52684       365.71
   20971.519     0.997656        52701       426.67
   21184.511     0.998047        52721       512.00
   21331.967     0.998242        52734       568.89
   21921.791     0.998437        52742       640.00
   22085.631     0.998633        52753       731.43
   22396.927     0.998828        52763       853.33
   23003.135     0.999023        52773      1024.00
   23199.743     0.999121        52780      1137.78
   23232.511     0.999219        52784      1280.00
   23314.431     0.999316        52788      1462.86
   23576.575     0.999414        52794      1706.67
   23642.111     0.999512        52799      2048.00
   23658.495     0.999561        52801      2275.56
   23756.799     0.999609        52804      2560.00
   23805.951     0.999658        52806      2925.71
   23887.871     0.999707        52810      3413.33
   23920.639     0.999756        52812      4096.00
   23937.023     0.999780        52813      4551.11
   23953.407     0.999805        52814      5120.00
   24018.943     0.999829        52816      5851.43
   24051.711     0.999854        52817      6826.67
   24068.095     0.999878        52818      8192.00
   24084.479     0.999890        52821      9102.22
   24084.479     0.999902        52821     10240.00
   24084.479     0.999915        52821     11702.86
   24084.479     0.999927        52821     13653.33
   24084.479     0.999939        52821     16384.00
   24100.863     0.999945        52822     18204.44
   24100.863     0.999951        52822     20480.00
   24100.863     0.999957        52822     23405.71
   24117.247     0.999963        52823     27306.67
   24117.247     0.999969        52823     32768.00
   24117.247     0.999973        52823     36408.89
   24117.247     0.999976        52823     40960.00
   24117.247     0.999979        52823     46811.43
   24133.631     0.999982        52824     54613.33
   24133.631     1.000000        52824          inf
#[Mean    =    11510.861, StdDeviation   =     3757.780]
#[Max     =    24117.248, Total count    =        52824]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  79765 requests in 30.07s, 15.19MB read
  Non-2xx or 3xx responses: 410
Requests/sec:   2652.92
Transfer/sec:    517.26KB